# Titanic Mini Project

Welcome to the mini project! 

Here we're gonna use the titanic data set to learn some key data science skills to get you going. The project will be broken down into 

- Data Wrangling
- Data Visualisation 
- Predictive modelling 
- Conclusions

The aim of this project is to analyse the Titanic data set and predict who survived the Titanic disaster.

## Data Wrangling

Before beginning you need to download and read in the data. Instructions can be found here. https://makeschool.org/mediabook/oa/tutorials/titanic-dataset-tutorial-an-intro-to-data-analysis-and-statistics-n40/getting-our-bearings/ 
Please use the TRAIN csv for all this analysis not test!

In [3]:
import pandas as pd

Problem 1 - Look at the data.

In [7]:
df = pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Problem 2 - How many rows are in the data

In [9]:
num_rows = df.shape[0]
print("Number of rows:", num_rows)

Number of rows: 891

Problem 3 - How many columns are in the data

In [11]:
num_cols = df.shape[1]
print("Number of columns:", num_cols)

Number of columns: 12

Problem 4 - What is the mean, max and min age in the data?

In [12]:
# Calculate minimum, maximum, and mean of the 'Age' column
age_min = df['Age'].min()
age_max = df['Age'].max()
age_mean = df['Age'].mean()

# Print the results
print("Minimum Age:", age_min)
print("Maximum Age:", age_max)
print("Mean Age:", age_mean)

Minimum Age: 0.42
Maximum Age: 80.0
Mean Age: 29.69911764705882

Problem 5 - Workout the difference between min and max age

In [23]:
age_dif = age_max - age_min
print("Max/Min Age difference:", age_dif)

Max/Min Age difference: 79.58

Problem 6 - What are the different data types in the data frame

In [15]:
# Get the data types of columns
column_types = df.dtypes

# Print the column data types
print(column_types)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Problem 7 - How many of each data type are there (hint: each column has a data type so amount of columns should = answer)

In [16]:
# Count the number of columns for each data type
data_type_counts = df.dtypes.value_counts()

# Print the data type counts
print(data_type_counts)

int64      5
object     5
float64    2
Name: count, dtype: int64

Problem 8 - How many distinct cabins are there (hint: remember distinct!)

In [17]:
# Count the number of distinct cabins
cabin_count = df['Cabin'].nunique()

# Print the number of distinct cabins
print("Number of distinct cabins:", cabin_count)

Number of distinct cabins: 147

Problem 9 - How many females were on board?

In [19]:
# Count the number of each level within the "Sex" column
sex_counts = df['Sex'].value_counts()

# Print the counts
print(sex_counts)

Sex
male      577
female    314
Name: count, dtype: int64

Problem 10 - Was there more males onboard or distinct cabins?

In [ ]:
# Save the number of males as a variable
num_males = sex_counts['male']

print("Number of males:", num_males)
print("Number of distinct cabins:", cabin_count)

Bonus Problem - What was the count of males and females aged between 20-40 that were

In [21]:
# Filter the data for males and females aged between 20 and 40
filtered_data = df[(df['Age'] >= 20) & (df['Age'] <= 40)]
male_count = filtered_data[filtered_data['Sex'] == 'male'].shape[0]
female_count = filtered_data[filtered_data['Sex'] == 'female'].shape[0]

# Print the counts
print("Number of males aged between 20 and 40:", male_count)
print("Number of females aged between 20 and 40:", female_count)

Number of males aged between 20 and 40: 262
Number of females aged between 20 and 40: 138